In [3]:
import numpy as np

In [4]:
import pandas as pd

In [6]:
s=pd.Series([1,3,5,np.nan,6,8])

In [7]:
s#jupyter 是在命令行编程，s在之前运行时已经被记录，包括import 等命令也是

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [15]:
s=pd.Series(np.random.randn(5),index=['a','b','c','d','e']) #series 可通过多维数组 矩阵 python对象创建 index指label 如果缺省默认为0~len（s） 
支持重复索引

In [16]:
s

a    0.826602
b   -1.096496
c   -0.154586
d    1.128465
e    0.236846
dtype: float64

In [17]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [21]:
d={'b':1,'c':2,'d':3}
pd.Series(d)

b    1
c    2
d    3
dtype: int64

In [25]:
d_s=pd.Series(d,index=['d','b','c','e']) #字典对应到series 中 key与标签的对应情况

In [28]:
d_s[s>s.median()]

d    3.0
dtype: float64

In [29]:
s.array #扩展数组

<PandasArray>
[ 0.8266022741157615, -1.0964959923648057, -0.1545859575898926,
  1.1284653144871182,  0.2368463183092424]
Length: 5, dtype: float64

In [30]:
s.to_numpy()

array([ 0.82660227, -1.09649599, -0.15458596,  1.12846531,  0.23684632])

In [53]:
d_s.get('e') #通过get 访问没有标签时也不会报错keyerror

nan

In [54]:
s+d_s #计算根据索引自动对齐 索引优先，当索引多时 赋值nan 少时删除没有索引数据

a         NaN
b   -0.096496
c    1.845414
d    4.128465
e         NaN
dtype: float64

In [55]:
d = {'one': pd.Series([1., 2., 3.], index=['a', 'b', 'c']),
'two': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}

In [58]:
df=pd.DataFrame(d) #标准的series

In [59]:
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [61]:
pd.DataFrame(d,index=['d','b','a'],columns=['two','three'])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [62]:
d = {'one': [1., 2., 3., 4.],
'two': [4., 3., 2., 1.]}
pd.DataFrame(d) #数组字典  key值默认为columns

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [63]:
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data2) #字典列表 默认字典内为columns

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [64]:
pd.DataFrame.from_dict(dict([('A', [1, 2, 3]), ('B', [4, 5, 6])]))#字典字典

   A  B
0  1  4
1  2  5
2  3  6

In [65]:
pd.DataFrame.from_dict(dict([('A', [1, 2, 3]), ('B', [4, 5, 6])]),orient='index')

   0  1  2
A  1  2  3
B  4  5  6

In [68]:
df['one'] #提取 
df['flag'] = df['one'] > 2 #增加
del df['one'] #删除

    flag
a  False
b  False
c   True
d  False

In [74]:
df.insert(1, 'one', df['flag']) #insert 在第1列 标签名 one 具体数据是来自df["flag"]
df

    flag    one    bar
a  False  False  False
b  False  False  False
c   True   True   True
d  False  False  False

In [75]:
# dataframe_name.assign(new_column=exisit_column) 利用已有列产生新的列 返回数据副本

In [77]:
df.loc['b'] #用标签选择行

flag    False
one     False
bar     False
Name: b, dtype: bool

In [81]:
df.iloc[1] #用行号选择行

flag    False
one     False
bar     False
Name: b, dtype: bool

In [80]:
df[0:2] #用行切片选择行

    flag    one    bar
a  False  False  False
b  False  False  False

In [83]:
df.T #转置

          a      b     c      d
flag  False  False  True  False
one   False  False  True  False
bar   False  False  True  False

In [95]:
df=pd.DataFrame(np.random.randn(3,4), index=['1', '2', '3'], columns=['a','b','c','d'])
df

          a         b         c         d
1 -2.120260  0.474233 -0.146304 -0.829343
2  0.797578  1.848369  0.116729 -0.512676
3  0.278267 -0.182906 -0.730795  0.538023

In [93]:
np.exp(df) #可使用log、exp、sqrt等Numpy通用函数

          a         b         c         d
1  1.114020  2.038752  0.400266  0.365227
2  2.012575  1.242347  0.665656  0.824551
3  0.124641  0.415790  1.113942  3.291630

In [97]:
df.a #可以像访问属性一样访问列

1   -2.120260
2    0.797578
3    0.278267
Name: a, dtype: float64